Конфигурация/src/Documents/РезервированиеДенег/РезервированиеДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезервированиеДенег</name>
  <registerRecords>AccumulationRegister.РезервыДенег</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>СтатьяДвижения</name>
      <type>
        <types>CatalogRef.ДвиженияДенег</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/РезервыДенег/РезервыДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыДенег</name>
  <comment>Доп. функционал</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяДвижения</name>
    <type>
      <types>CatalogRef.ДвиженияДенег</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/РезервированиеДенег/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РезервыДенег.Записывать = Истина;
	Движения.РезервыДенег.Очистить();
	
	Для Каждого ТекСтрока Из ТабличнаяЧасть Цикл
		
		ДвижениеРезервыДенег = Движения.РезервыДенег.ДобавитьПриход();
		ДвижениеРезервыДенег.Период = Дата;
		ДвижениеРезервыДенег.СтатьяДвижения = ТекСтрока.СтатьяДвижения;
		ДвижениеРезервыДенег.Месяц = НачалоМесяца(Месяц);
		ДвижениеРезервыДенег.Сумма = ТекСтрока.Сумма;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
